resources/help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-14 Sat 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bot_269使用說明</title>
<meta name="author" content="CToID(269)" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">bot_269使用說明</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc908263">1. 幫助指令(help)</a></li>
<li><a href="#orgef87f2f">2. 前綴字(prefix)</a></li>
<li><a href="#orgca563bd">3. 伺服器設定用指令(svr_conf)</a></li>
<li><a href="#org8fa988b">4. 按表情符號來取得身份組指令(role_select)</a></li>
<li><a href="#orge2bcdbf">5. 回覆指令(reply)</a></li>
<li><a href="#org27f47ed">6. 回應指令(react)</a></li>
<li><a href="#org7dfc334">7. 吃什麼指令</a></li>
<li><a href="#orgbaaf313">8. 今日運勢指令</a></li>
</ul>
</div>
</div>
<p>
<b>預設前綴為a269(欸, 269), 某些伺服器可能有修改過前綴，可以使用( <code>PREFIX</code> )來查詢。</b><br />
<b>說明書中有and符號請忽略，這些是用來做分隔之用，指令中不會有這些符號。</b><br />
</p>

<p>
請使用 <code>a269 help &lt;目錄中的數字(如1, 2, 3等)&gt;</code> 來看更詳細的說明。<br />
直接在聊天室中輸入 <code>COPYRIGHT</code> 或 <code>LICENSE</code> 來查看版權聲明和授權條款。<br />
原始碼可以在 <a href="https://github.com/funk443/bot_269">https://github.com/funk443/bot_269</a> 找到。<br />
</p>

<p>
有任何問題也可以連絡我(雖然我也不一定知道怎麼解決就是了):<br />
</p>
<ul class="org-ul">
<li>Discord: ID#2120<br /></li>
<li>e-mail: funk443@tutanota.com<br /></li>
<li>巴哈: CToID(funk443)<br /></li>
</ul>

<p>
copyright (C) 2022 CToID<br />
</p>

<p>
&amp;<br />
</p>


<div id="outline-container-orgc908263" class="outline-2">
<h2 id="orgc908263"><span class="section-number-2">1.</span> 幫助指令(help)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
幫助目錄<br />
用法: <code>a269 help</code><br />
</p>

<p>
召喚說明書的目錄。<br />
</p></li>

<li>詳細說明<br />
用法: <code>a269 help &lt;目錄中的數字(1, 2, 3等)&gt;</code><br />
&amp;<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgef87f2f" class="outline-2">
<h2 id="orgef87f2f"><span class="section-number-2">2.</span> 前綴字(prefix)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
查詢目前前綴字(PREFIX)<br />
用法: <code>PREFIX</code><br />
</p>

<p>
如題，只要輸入 <code>PREFIX</code> 就好了，不用加任何前綴字。<br />
</p></li>

<li>更改前綴字(change_prefix)<br />
用法: <code>a269 change_prefix &lt;要改成什麼前綴字&gt;</code><br />
可以將機器人在這個伺服器的前綴字更改成你想要的字串。<br />
<b>建議把想更改的前綴字用雙引號(")包起來，以免空白被吃</b><br />
<b>後面要空格要自己加喔</b><br />
<b>如果要更改的內容為空，機器人會改回預設前綴字(​a269 )</b>  <br />
&amp;<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgca563bd" class="outline-2">
<h2 id="orgca563bd"><span class="section-number-2">3.</span> 伺服器設定用指令(svr_conf)</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>只有伺服器擁有者或管理員可用</b><br />
</p>

<ul class="org-ul">
<li>查看目前設定值<br />
用法: <code>a269 svr_conf</code><br /></li>

<li>增加管理員<br />
用法: <code>a269 svr_conf + admin &lt;@使用者&gt;</code><br /></li>

<li>刪除管理員<br />
用法: <code>a269 svr_conf - admin &lt;@使用者&gt;</code><br /></li>

<li>管理員是否能再增加/刪除管理員<br />
用法: <code>a269 svr_conf set allow_add_by_admin true/false</code><br />
&amp;<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8fa988b" class="outline-2">
<h2 id="org8fa988b"><span class="section-number-2">4.</span> 按表情符號來取得身份組指令(role_select)</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>只有伺服器擁有者或管理員可用</b><br />
</p>

<p>
用法: <code>a269 role_select "&lt;訊息內容&gt;" "&lt;表情符號1&gt;/&lt;@身份組1&gt;, &lt;@身份組2&gt;, ...." "&lt;表情符號2&gt;/&lt;@身份組1&gt;, &lt;@身份組2&gt;, ..." ...</code><br />
</p>

<p>
<b>雙引號(")跟斜線(/)都要記得照上面的格式輸入</b><br />
在哪個頻道輸入這個指令，他訊息就會傳到那個頻道。<br />
&amp;<br />
</p>
</div>
</div>
<div id="outline-container-orge2bcdbf" class="outline-2">
<h2 id="orge2bcdbf"><span class="section-number-2">5.</span> 回覆指令(reply)</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
新增/修改回覆(add)<br />
用法1: <code>a269 reply add &lt;觸發關鍵字&gt; &lt;回覆內容&gt;</code><br />
用法2: <code>a269 reply add &lt;觸發關鍵字&gt;</code><br />
</p>

<p>
用來新增想要的回覆，如果關鍵字已存在則修改該關鍵字的回覆內容。<br />
如果回覆內容或關鍵字有含空格，應以雙引號(")包起來。<br />
用法2可以附加多張圖片來讓機器人回覆圖片。<br />
</p></li>

<li><p>
刪除回覆(del)<br />
用法: <code>a269 reply del &lt;觸發關鍵字&gt;</code> <br />
</p>

<p>
用來刪除在資料庫中的回覆。<br />
</p></li>

<li><p>
尋找關鍵字(findk)<br />
用法: <code>a269 reply findk &lt;回覆內容&gt;</code> <br />
</p>

<p>
用回覆來反查關鍵字。<br />
</p></li>

<li><p>
尋找回覆(findv)<br />
用法: <code>a269 reply findv &lt;觸發關鍵字&gt;</code> <br />
</p>

<p>
用關鍵字來找回覆。<br />
</p></li>

<li>列出所有關鍵字列表(list)<br />
用法: <code>a269 reply list</code>  <br />
&amp;<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org27f47ed" class="outline-2">
<h2 id="org27f47ed"><span class="section-number-2">6.</span> 回應指令(react)</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><p>
新增/修改回應(add)<br />
用法: <code>a269 react add &lt;觸發關鍵字&gt; &lt;要回應的表符1&gt; &lt;要回應的表符2&gt;...(表符間可以用空格格開，也可以不用)</code><br />
</p>

<p>
用來新增想要的回應，如果關鍵字已存在則修改該關鍵字的回應表符。<br />
</p></li>

<li><p>
刪除回覆(del)<br />
用法: <code>a269 reply del &lt;觸發關鍵字&gt;</code> <br />
</p>

<p>
用來刪除在資料庫中的回應。<br />
</p></li>

<li><p>
尋找關鍵字(findk)<br />
用法: <code>a269 reply findk &lt;回應表符&gt;</code> <br />
</p>

<p>
用回應來反查關鍵字。<br />
</p></li>

<li><p>
尋找回覆(findv)<br />
用法: <code>a269 reply findv &lt;觸發關鍵字&gt;</code> <br />
</p>

<p>
用關鍵字來找回應。<br />
</p></li>

<li>列出所有關鍵字列表(list)<br />
用法: <code>a269 reply list</code>  <br />
&amp;<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org7dfc334" class="outline-2">
<h2 id="org7dfc334"><span class="section-number-2">7.</span> 吃什麼指令</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>從預設清單中挑食物<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼</code> <br />
</p>

<ul class="org-ul">
<li>新增食物到預設清單(add)<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼 add &lt;食物1&gt; &lt;食物2&gt;....(食物間以空白隔開)</code> <br />
</p>

<ul class="org-ul">
<li>將食物從預設清單中移除(del)<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼 del &lt;食物1&gt; &lt;食物2&gt;....(食物間以空白隔開)</code><br />
</p>

<ul class="org-ul">
<li>將預設清單清空(clr)<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼 clr</code><br />
</p>

<ul class="org-ul">
<li>查看預設清單(list)<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼 list</code><br />
</p>

<ul class="org-ul">
<li>不使用預設清單挑選食物<br /></li>
</ul>
<p>
用法: <code>a269 吃什麼 &lt;食物1&gt; &lt;食物2&gt;....(食物間以空白隔開)</code><br />
&amp;<br />
</p>
</div>
</div>
<div id="outline-container-orgbaaf313" class="outline-2">
<h2 id="orgbaaf313"><span class="section-number-2">8.</span> 今日運勢指令</h2>
<div class="outline-text-2" id="text-8">
<p>
用法: <code>a269 今日運勢</code><br />
</p>

<p>
讓機器人告訴你你今天運氣怎麼樣。一天只能用一次。<br />
用超過一次的話機器人會罵你喔。<br />
&amp;<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: CToID(269)</p>
<p class="date">Created: 2022-05-14 Sat 00:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
